[
    {
        "image": "https://drive.google.com/file/d/1FfcrYXCYlvX00nCflS6zzTX0TB0Dsqnb/view?usp=sharing",
        "first_name": "Tanabodee",
        "last_name": "Yambangyang",
        "address": "98/7, Moo 1, Wimonnut Village, Ya Chan Uthit Alley, Khun Kaeo Sub-district, Nakhon Chai Si District, Nakhon Pathom Province, 73120",
        "about_me": "I'm Tanabodee YAMBANGYANG, a software engineer focusing on frontend development and web applications. I have hands-on experience building user interfaces and have also worked on model implementation for recommendation systems as part of my academic projects.\n\nI'm now aiming to expand my skills in backend development and other areas of software engineering to become a more versatile, well-rounded developer capable of creating efficient, scalable, and impactful applications.",
        "contact": {
            "facebook": "https://www.facebook.com/profile.php?id=100007994625777",
            "linkedin": "https://www.linkedin.com/in/tanabodee-yambangyang-11a3882a2/",
            "github": "https://github.com/Tanabodee-Yambangyang",
            "email": "tanabodeeyambangyang@gmail.com"
        },
        "introduction": "I’m passionate about building scalable, user-friendly applications and pursuing a Master's Degree in Software Engineering.",
        "education": [
            {
                "id": "1",
                "degrees": "Bachelor",
                "faculty": "Engineering",
                "major": "Software & Knowledge Engineering (International Program)",
                "university": "Kasetsart University, Bangkhen",
                "period": "2021 - 2025"
            }
        ],
        "projects": [
            {
                "id": 1,
                "slug": "togetherwherever",
                "name": "Senior Project – TogetherWherever",
                "duration": "Jan 2024 - Mar 2025",
                "description": "An AI-powered travel planning web application that optimizes group trip experiences by analyzing the preferences of multiple group members to recommend suitable destinations and collaboratively build personalized travel itineraries. The system uses a hybrid approach that combines the Apriori algorithm, content-based filtering, and critiquing-based feedback to maximize group satisfaction and fairness.",
                "technologies": [
                    "Next.js",
                    "TypeScript",
                    "Tailwind CSS",
                    "Python",
                    "Apriori Algorithm"
                ],
                "github": "https://github.com/TogetherWherever",
                "responsibilities": [
                    "Contributed to all software development stages, including UI/UX design, documentation, sprint planning, code reviews, and meetings.",
                    "Built frontend with Next.js, TypeScript, and Tailwind CSS for trip planning, group voting, and itinerary visualization.",
                    "Integrated FastAPI backend APIs with frontend.",
                    "Designed and implemented a recommendation engine using Apriori algorithm, content-based filtering, and critiquing-based feedback for group voting.",
                    "Developed the recommendation logic and trip generation model.",
                    "Deployed the app on Vercel, ensuring responsiveness and accessibility.",
                    "Participated in user testing, metrics analysis (Jaccard similarity, precision, recall, fairness), and iterative improvements based on feedback."
                ],
                "images": [
                    "/togetherwherever/togetherwherever0.png",
                    "/togetherwherever/togetherwherever1.png",
                    "/togetherwherever/togetherwherever2.png",
                    "/togetherwherever/togetherwherever3.png",
                    "/togetherwherever/togetherwherever4.png",
                    "/togetherwherever/togetherwherever5.png",
                    "/togetherwherever/togetherwherever6.png",
                    "/togetherwherever/togetherwherever7.png",
                    "/togetherwherever/togetherwherever8.png",
                    "/togetherwherever/togetherwherever9.png",
                    "/togetherwherever/togetherwherever10.png"
                ]
            },
            {
                "id": 2,
                "slug": "referite",
                "name": "Referite",
                "duration": "Oct 2023 - Nov 2023",
                "description": "A medal schedule and result management web application for the 2024 Olympic Games simulation. The application simulates the operational workflow of Olympic result reporting, including medal tracking, schedule updates, and result editing for various sports and events. The project emphasized full-cycle development and collaboration in a team setting.",
                "technologies": [
                    "React.js",
                    "TypeScript",
                    "CSS"
                ],
                "github": "https://github.com/Referite",
                "responsibilities": [
                    "Led the Frontend Development Team, managing planning and coordination of all interface work.",
                    "Owned frontend development of the Medal Outcomes Document System page using React.js, TypeScript, and CSS.",
                    "Designed and built the entire UI, including input mechanics for recording and editing medal outcomes by sport and event.",
                    "Created dynamic, responsive components ensuring smooth user interactions.",
                    "Integrated frontend with FastAPI backend for data flow and validation.",
                    "Collaborated with backend developers and UI designers to maintain app consistency.",
                    "Conducted frontend code reviews and optimized core workflows."
                ],
                "images": [
                    "/referite/referite0.png",
                    "/referite/referite1.png",
                    "/referite/referite2.png",
                    "/referite/referite3.png",
                    "/referite/referite4.png",
                    "/referite/referite5.png"
                ]
            },
            {
                "id": 3,
                "slug": "wongnung",
                "name": "WongNung",
                "duration": "Oct 2022 - Nov 2022",
                "description": "WongNung is a community-driven film review app where movie fans join Fandoms based on shared interests, share reviews, and get personalized recommendations within their groups.",
                "technologies": [
                    "Python",
                    "Django",
                    "OAuth",
                    "unittest",
                    "Selenium"
                ],
                "github": "https://github.com/WongNung/WongNung",
                "responsibilities": [
                    "Developed Django data models for users, reviews, films, and fandom groups.",
                    "Performed automated testing with unittest for backend logic and Selenium for end-to-end workflows.",
                    "Implemented OAuth authentication (Google, GitHub, Discord) for secure user login.",
                    "Collaborated on backend logic to ensure stable and testable core Fandom and review features."
                ],
                "images": [
                    "/wongnung/wongnung1.png",
                    "/wongnung/wongnung2.png",
                    "/wongnung/wongnung3.png",
                    "/wongnung/wongnung4.png",
                    "/wongnung/wongnung5.png"
                ]
            }
        ],
        "experiences": [
            {
                "id": 1,
                "slug": "erudite-software-engineering-intern",
                "company": "Erudite Company Limited",
                "position": "Intern – Software Engineering (Front-end developer)",
                "duration": "Jun 2024 – Dec 2024",
                "responsibilities": [
                    "Collaborating in the development team for requirement analysis and understanding objectives.",
                    "Implementing user interfaces with Next.js and Tailwind CSS.",
                    "Integrating backend APIs into Front-end interfaces.",
                    "Collaborating in code reviews and technical discussions with the team to enhance project quality."
                ]
            }
        ],
        "skills": {
            "programming_languages": [
                "Python",
                "JavaScript",
                "TypeScript",
                "C++",
                "Java",
                "SQL"
            ],
            "web_development": [
                "HTML",
                "CSS",
                "React.js",
                "Next.js",
                "Django",
                "Tailwind CSS"
            ],
            "tools_platforms": [
                "unittest",
                "Selenium"
            ],
            "methodologies": [
                "Agile",
                "Scrum"
            ],
            "soft_skills": [
                "Problem Solving",
                "Collaboration",
                "Communication",
                "Adaptability"
            ],
            "languages": [
                "Thai (Native)",
                "English"
            ]
        }
    }
]